In [25]:
import pandas as pd
from matplotlib import pyplot as plt

In [30]:
data = pd.read_csv("data.csv", header=None)
names = pd.read_csv("names.csv", header=None)

In [31]:
data.head()

   0   1   2   3   4   5   6   7   8   9   10  11  12
0   0   1  -1   0   0   0   0   0   1  -1   0   0   1
1   0   0  -1   1   1   0   0   0   0   0   0   0   1
2   0   0   0   0   0  -1   0   1   0   0   0   0   0
3   0   0   0   0   0   0   0   0 NaN   0   0   0   0
4   0   0   0   0   0   0   0   0   0   0   0   0   0

In [32]:
names

            0
0     Brandon
1     Cameron
2   Christian
3       Colby
4      Daniel
5      Darwin
6        Evan
7        Jake
8      Jordan
9      Nathan
10    Patrick
11      Timmy
12      Tommy

In [29]:
pd.read_csv?